#include <stdio.h>
#include <stdlib.h>

typedef enum { false, true } bool;

int num;
int **W;

void m_coloring(int i, int n, int m, int **W, int *vcolor);
bool promising(int i, int *vcolor);

int main(void) {
	int i;
	int j;
	int n = 25;
	int m = 1;



	int *vcolor = (int*)malloc(sizeof(int) * (n + 1));
	for (i = 0; i <= n; i++)
		vcolor[i] = 0;

	W = (int**)malloc(sizeof(int*) * (n + 1));
	for (i = 0; i <= n; i++)
		W[i] = (int*)malloc(sizeof(int) * (n + 1));

	for (i = 0; i <= n; i++)
		for (j = 0; j <= n; j++)
			W[i][j] = 0;
	
	//1.강서구
	W[1][2] = 1;
	W[1][5] = 1;
	W[1][6] = 1;

	//2.양천구
	W[2][1] = 1;
	W[2][3] = 1;
	W[2][5] = 1;

	//3.구로구
	W[3][2] = 1;
	W[3][4] = 1;
	W[3][5] = 1;
	W[3][10] = 1;

	//4.금천구
	W[4][3] = 1;
	W[4][10] = 1;

	//5.영등포구
	W[5][1] = 1;
	W[5][2] = 1;
	W[5][3] = 1;
	W[5][6] = 1;
	W[5][8] = 1;
	W[5][9] = 1;

	//6.마포구
	W[6][1] = 1;
	W[6][5] = 1;
	W[6][7] = 1;
	W[6][8] = 1;
	W[6][24] = 1;
	W[6][25] = 1;

	//7.중구
	W[7][6] = 1;
	W[7][8] = 1;
	W[7][16] = 1;
	//W[7][17] = 1;
	W[7][23] = 1;
	W[7][24] = 1;

	//8.용산구
	W[8][5] = 1;
	W[8][6] = 1;
	W[8][7] = 1;
	W[8][9] = 1;
	W[8][11] = 1;
	W[8][12] = 1;
	W[8][16] = 1;

	//9.동작구
	W[9][5] = 1;
	W[9][8] = 1;
	W[9][10] = 1;
	W[9][11] = 1;

	//10.관악구
	W[10][3] = 1;
	W[10][4] = 1;
	W[10][9] = 1;
	W[10][11] = 1;

	//11.서초구
	W[11][8] = 1;
	W[11][9] = 1;
	W[11][10] = 1;
	W[11][12] = 1;

	//12.강남구
	W[12][8] = 1;
	W[12][11] = 1;
	W[12][13] = 1;
	W[12][15] = 1;
	W[12][16] = 1;

	//13.송파구
	W[13][12] = 1;
	W[13][14] = 1;
	W[13][15] = 1;

	//14.강동구
	W[14][13] = 1;
	W[14][15] = 1;

	//15.광진구
	W[15][12] = 1;
	W[15][13] = 1;
	W[15][14] = 1;
	W[15][16] = 1;
	W[15][17] = 1;
	W[15][18] = 1;
	
	//16.성동구
	W[16][7] = 1;
	W[16][8] = 1;
	W[16][12] = 1;
	W[16][15] = 1;
	W[16][17] = 1;

	//17.동대문구
	//W[17][7] = 1;
	W[17][15] = 1;
	W[17][16] = 1;
	W[17][18] = 1;
	W[17][22] = 1;
	W[17][23] = 1;

	//18.중랑구
	W[18][15] = 1;
	W[18][17] = 1;
	W[18][19] = 1;
	W[18][22] = 1;

	//19.노원구
	W[19][18] = 1;
	W[19][20] = 1;
	W[19][21] = 1;
	W[19][22] = 1;

	//20.도봉구
	W[20][19] = 1;
	W[20][21] = 1;

	//21.강북구
	W[21][19] = 1;
	W[21][20] = 1;
	W[21][22] = 1;

	//22.성북구
	W[22][17] = 1;
	W[22][18] = 1;
	W[22][19] = 1;
	W[22][21] = 1;
	W[22][23] = 1;

	//23.종로구
	W[23][7] = 1;
	W[23][17] = 1;
	W[23][22] = 1;
	W[23][24] = 1;
	W[23][25] = 1;

	//24.서대문구
	W[24][6] = 1;
	W[24][7] = 1;
	W[24][23] = 1;
	W[24][25] = 1;

	//25.은평구
	W[25][6] = 1;
	W[25][23] = 1;
	W[25][24] = 1;

	i = 0;
	m = 1;
	num = 0;

	while (1) {
		m_coloring(0, n, m, W, vcolor);
		if (num > 0)
		{
			printf("필요한 색의 최수 갯수 : %d\n", m);
			printf("경우의 수 : %d\n", num);
			break;
		}
		m++;
	}
	return 0;
}

void m_coloring(int i, int n, int m, int **W, int *vcolor)
{
	int color;
	if (promising(i, vcolor)) {
		if (i == n)
			num++;
		else if (i < n)
			for (color = 1; color <= m; color++) {
				vcolor[i + 1] = color;
				m_coloring(i + 1, n, m, W, vcolor);
			}
	}
}

bool promising(int i, int *vcolor)
{
	int j = 1;
	bool swich = true;

	while ((j < i) && swich) {
		if (W[i][j] && (vcolor[i] == vcolor[j]))
			swich = false;
		j++;
	}
	return swich;
}